chat_system_707066344_actor_description=Stephan Hall. Menagerie owner.
chat_system_707066344_snap_1_question=^?^So, have you found out anything about the Evil Beholders?
chat_system_707066344_snap_1_answer_0=^?^I've visited old Archon. Here, he sent you a pile of manuscripts about these strange animals.
chat_system_707066344_snap_1_answer_1=^?^No, I haven't yet. But don't worry, I'll visit old Archon.
chat_system_707066344_snap_2_question=^?^Fine, fine! Finally I'll know the truth, and be able to sleep. Thank you, [player], very much.<br>[reward]
chat_system_707066344_snap_2_answer_0=^?^By the way, I've looked through these manuscripts. And, uh... I'm not so sure they'll answer your questions.
chat_system_707066344_snap_2_answer_1=^?^Thank you, I hope you'll find out what you need in these papers.
chat_system_707066344_snap_4_question=^?^Hmm... What are you talking about? - No, don't tell me. I'll figure it out by myself.
chat_system_707066344_snap_4_answer_0=^?^Have fun, then. Goodbye!
chat_system_707066344_snap_0_question=^?^No, nothing, nothing special. I've just received several unusual animals - the miners from the Creiston Mines brought them to me. They call them "Evil Beholders." They say there are a lot of these beasts in the dwarven mines.<br>I've seen a lot in my life, but this... You must understand me. One thing never leaves me in peace. I can't even sleep at night, trying to find it out: how do they breed? I've examined them this way, that way and every way, looking all over them, but I still have no idea...
chat_system_707066344_snap_0_answer_0=^?^Can't you just ask somebody?
chat_system_707066344_snap_3_question=^?^If only there was somebody I could ask. Nobody has heard of them, we don't have these creatures here. Maybe the dwarves know....<br>Anyway, I want you to visit old Archon in Verlon Forest. He's the former owner of a monster circus. When he was young, he showed his beasts all over Darion, he was said to mate each and all.<br>Visit him, alright? I'll repay your kindness as I can.<br>[reward]
chat_system_707066344_snap_3_answer_0=^?^I have to go to Verlon Forest anyway, so why not visit Archon then? I'll ask him if he knows how to breed these Evil Beholders.
